#+TITLE: ya-bao-web-gh
ya-bao-web 的 github pages 控制文件
* index.html
- [[file+emacs:index.org][index.org]]
  #+begin_src html 
    <!DOCTYPE html>
    <html>
      <head>
	<meta charset="utf-8" />
	<title>各申機械設計工作室工作記錄</title>
	<link rel="shortcut icon" href="images/EA-logo.ico" />

	<meta name="google-site-verification" content="6qFjj1TtFctlKH--W9gYQJ7MDsIjT6OzJtFhyU-Epz0" />
      </head>
      <body>
	<h1>各申機械設計工作室工作記錄</h1>
	<h1> Hellow world</h1>
	<h1> <a href=
      </body>
    </html>  
  #+end_src
* ya-bao-doc-database.org
[[file+emacs:ya-bao-doc-database.org][ya-bao-doc-database.org]]
* OBS 應用企劃
* readme.org
* [[file+emacs:./blog.org][blog.org]]
* sitemap
  使用 common lisp 產生 sitemap
  #+begin_src lisp
    (ql:quickload "cxml")

    (defun generate-sitemap (urls)
      "Creates the sitemap file"
      (with-open-file (file "./sitemap.xml"
			    :direction :output
			    :element-type :default
			    :if-exists  :supersede)
	(cxml:with-xml-output (cxml:make-octet-stream-sink file :indentation 1 :canonical nil)
	  (cxml:with-element "urlset"
	    (cxml:attribute "xmlns" "http://www.sitemaps.org/schemas/sitemap/0.9")
	    ;; create the tags
	    (dolist (item urls)
	      (cxml:with-element "url"
		(cxml:with-element "loc"
		  (cxml:text item))
		(cxml:with-element "changefreq"
		  (cxml:text "daily"))
		(cxml:with-element "priority"
			  (cxml:text "0.5"))))))))

    (defun create-sitemap (&rest urls)
      (generate-sitemap urls))

    (defun web-url (url)
      (format nil "https://roscoe-tw.github.io/ya-bao-web/~A" url))

    ;;; /tmp/sitemap.xml
    (progn
      (create-sitemap "https://roscoe-tw.github.io/ya-bao-web/index.html"
		      "https://roscoe-tw.github.io/ya-bao-web/blog.html"
		      (web-url "ya-bao-doc-database.html")
		      (web-url "asme-viii-ucs-66.html")))
  #+end_src

  #+RESULTS:
  : #<SB-SYS:FD-STREAM for "file /tmp/sitemap.xml" {1003A703E3}>
* blog.org
* robots.txt
#+begin_src text :tangle robots.txt
  User-agent:*
  Disallow:/

  User-agent:Googlebot
  Disallow:/*.org$
  Disallow:/doc/
  Disallow:/.git/
  Disallow:/maxima/
  Disallow:/pic/
  Allow: /

  User-agent:bingbot
  Disallow:/*.org$
  Disallow:/doc/
  Disallow:/.git/
  Disallow:/maxima/
  Disallow:/pic/
  Allow: /

  Sitemap: https://roscoe-tw.github.io/ya-bao-web/sitemap.xml
#+end_src
